# Step - 1 : Import the Packages

In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sea

# Step - 2 : Create a DataFrame Using List.

In [8]:
l = ['Ramesh', 'Suresh', 'Satish']
df = pd.DataFrame(l, columns=["name"])
df

     name
0  Ramesh
1  Suresh
2  Satish

# Step - 3 : Create  a DataFrame using multiple list

In [9]:
l = ['Ramesh', 'Suresh', 'Satish']
age = [22, 33, 42]
df = pd.DataFrame(zip(l, age), columns=["name", "age"])
df

     name  age
0  Ramesh   22
1  Suresh   33
2  Satish   42

In [10]:
"""
pd.DataFrame(data, index, columns)
data : array-list 
indexx : array list 
columns : array list
"""

'\npd.DataFrame(data, index, columns)\ndata : array-list \nindexx : array list \ncolumns : array list\n'

# Step - 4 : Create a DataFrame using Multiple list and Change the Index and Columns

In [11]:
l = ['Ramesh', 'Suresh', 'Satish']
age = [22, 33, 42]
df = pd.DataFrame(zip(l, age), columns=["name", "age"], index = ['a', 'b', 'c'])
df

     name  age
a  Ramesh   22
b  Suresh   33
c  Satish   42

In [12]:
l = ['Ramesh', 'Suresh', 'Satish']
age = [22, 33, 42]
city = ['Chhindwata', 'Pandhurna', 'Nagpu']
df = pd.DataFrame(zip(l, age, city), columns=["name", "age", "city"], index = ['a', 'b', 'c'])
df

     name  age        city
a  Ramesh   22  Chhindwata
b  Suresh   33   Pandhurna
c  Satish   42       Nagpu

# Step - 5 : Already data frame available we need to Add Columns

In [13]:
l = ['Ramesh', 'Suresh', 'Satish']
age = [22, 33, 42]
city = ['Chhindwata', 'Pandhurna', 'Nagpu']
df = pd.DataFrame(zip(l, age, city), columns=["name", "age", "city"], index = ['a', 'b', 'c'])
print(df)
df["Marks"] = [90, 98, 34]
df

     name  age        city
a  Ramesh   22  Chhindwata
b  Suresh   33   Pandhurna
c  Satish   42       Nagpu

     name  age        city  Marks
a  Ramesh   22  Chhindwata     90
b  Suresh   33   Pandhurna     98
c  Satish   42       Nagpu     34

In [14]:
df["Marks"] = [90, 98, 78] # notice that the previous marks get changed

In [15]:
df

     name  age        city  Marks
a  Ramesh   22  Chhindwata     90
b  Suresh   33   Pandhurna     98
c  Satish   42       Nagpu     78

In [16]:
df ["age"], df["Marks"]

(a    22
 b    33
 c    42
 Name: age, dtype: int64,
 a    90
 b    98
 c    78
 Name: Marks, dtype: int64)

In [17]:
df["Marks"][2] = 1000

C:\Users\prath\AppData\Local\Temp\ipykernel_6888\3659829051.py:1: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment.
Such chained assignment never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

Try using '.loc[row_indexer, col_indexer] = value' instead, to perform the assignment in a single step.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html#chained-assignment
  df["Marks"][2] = 1000

In [18]:
df

     name  age        city  Marks
a  Ramesh   22  Chhindwata     90
b  Suresh   33   Pandhurna     98
c  Satish   42       Nagpu     78

            -  For already existed DataFrame the above method  

                        1. if column not available it will create a new **new column**
                        2. if column already available it will update the data.
            
            * while creating or updating , make sure the number of values are equal or not.

# Step - 6 : Create an Emply Data Frame and Update the Values.

In [19]:
df = pd.DataFrame()

df["Name"] = ["Pratham", "Kunal", "Rohit"]
df["Age"] = [22, 23, 21]
df

      Name  Age
0  Pratham   22
1    Kunal   23
2    Rohit   21

In [20]:
df = pd.DataFrame()
df["class", "students", "NoOfSections"] = [['I', 'II', 'III', "IV"], [100, 187, 93, 50], [2, 3, 5, 1]]
df

  (class, students, NoOfSections)
0                [I, II, III, IV]
1              [100, 187, 93, 50]
2                    [2, 3, 5, 1]

# Step 7 : Create a DataFrame using Dictionary

In [21]:
dict1 = {
    "Names" : ["Pratham", "Kunal", "Rohit"],
    "Age" : [20, 30, 40], 
    "City" : ["Bengluru", "Chennai", "Pune"]
}

df = pd.DataFrame(dict1)
df

     Names  Age      City
0  Pratham   20  Bengluru
1    Kunal   30   Chennai
2    Rohit   40      Pune

#### if you are giving one value per key then notice you must provide the index t

In [22]:
dict2 = {
    "name" : "Rohit Bhai",
    "Age" : 34, 
    "City" : "Haryana"
}

df2 = pd.DataFrame(dict2, index=[1, 2])
df2

         name  Age     City
1  Rohit Bhai   34  Haryana
2  Rohit Bhai   34  Haryana

# Step 8 : Saving the Dataframe 

        - on what naem you want to save. < File Name >
        - At what location you want to save. < Directory >

                    + Same python location then no need to mention 
                    + different from python location then need to provide.
            
        - Extension of the file 

                    + .csv(comma seperate file)
                    + .xlsx (Excel Sheet)

In [23]:
df.to_csv("abhi_banaya_hun.csv")

# Step 9 : Load or Read the Dataframe

In [29]:
pd.read_csv(r"C:\Users\prath\FullStackDataScience\Data-Science\pandas\DataFrame\abhi_banaya_hun.csv")

   Unnamed: 0    Names  Age      City
0           0  Pratham   20  Bengluru
1           1    Kunal   30   Chennai
2           2    Rohit   40      Pune

In [30]:
pd.read_csv("abhi_banaya_hun.csv")

   Unnamed: 0    Names  Age      City
0           0  Pratham   20  Bengluru
1           1    Kunal   30   Chennai
2           2    Rohit   40      Pune

# step - 10 : how to drop a row :

### Crete Dataframe with 

            - age 
            - names 
            - City 
            - marks 
            - and save in excel sheet

In [40]:
dict3 = {
    "Names" : ["Ramesh", "Suresh", "Satish"], 
    "Age" : [29, 39, 34], 
    "City" : ["Chennai", "Mumbai", "Bangluru"],
    "Marks" : [76, 89, 67]
}


df7 = pd.DataFrame(dict3)

df7

    Names  Age      City  Marks
0  Ramesh   29   Chennai     76
1  Suresh   39    Mumbai     89
2  Satish   34  Bangluru     67

In [81]:
df7.to_excel("data2.xlsx",index=False)

In [43]:
df7.to_csv("data1.xlsx", index=False)

In [46]:
df7 = pd.read_csv("data1.xlsx")
df7

    Names  Age      City  Marks
0  Ramesh   29   Chennai     76
1  Suresh   39    Mumbai     89
2  Satish   34  Bangluru     67

### df.drop(label, axis, index, columns, inplace)

In [47]:
df7.drop("Marks")

KeyError: "['Marks'] not found in axis"

In [49]:
df7.drop("Marks", axis = 1)

    Names  Age      City
0  Ramesh   29   Chennai
1  Suresh   39    Mumbai
2  Satish   34  Bangluru

In [51]:
# cheking original 
df7
# not changed

    Names  Age      City  Marks
0  Ramesh   29   Chennai     76
1  Suresh   39    Mumbai     89
2  Satish   34  Bangluru     67

In [52]:
df7.drop("Age", axis=0)

KeyError: "['Age'] not found in axis"

In [53]:
df7.drop(index = "Age")

KeyError: "['Age'] not found in axis"

In [54]:
df7.drop(columns = "Age")

    Names      City  Marks
0  Ramesh   Chennai     76
1  Suresh    Mumbai     89
2  Satish  Bangluru     67

In [55]:
df7.drop("Marks", axis = 1, inplace = True)

In [56]:
df7

    Names  Age      City
0  Ramesh   29   Chennai
1  Suresh   39    Mumbai
2  Satish   34  Bangluru

# Step - 11 : How to insert  a row completely

In [57]:
print(df7)

    Names  Age      City
0  Ramesh   29   Chennai
1  Suresh   39    Mumbai
2  Satish   34  Bangluru

In [69]:
df7["Names"]

0    Ramesh
1    Suresh
2    Satish
Name: Names, dtype: str

In [72]:
data = {
    "Names" : "Pratham",
    "Age" : 22,
    "City" : "Chhindwara"
}

df7.loc[3] = data
df7

     Names  Age        City
0   Ramesh   29     Chennai
1   Suresh   39      Mumbai
2   Satish   34    Bangluru
3  Pratham   22  Chhindwara

In [76]:
df7

     Names  Age        City
0   Ramesh   29     Chennai
1   Suresh   39      Mumbai
2   Satish   34    Bangluru
3  Pratham   22  Chhindwara

# *Step - 12* : Take two dataframes df1 and df2 : 

            - same columns
            - df1 is having two rows 
            - df2 is having two rows 

#### pd.concat([df1, df2])

In [ ]:
data1 = {
    "name" : ["pratham"],
    "qualification" : ["B.Tech"],
}
data2 = {
    "name" : ["rohit"],
    "qualification" : ["B.Com"],
}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
pd.concat([df1, df2], ignore_index= True).reset_index()

   index     name qualification
0      0  pratham        B.Tech
1      0    rohit         B.Com

## SQL Joins Using Pandas :

#### Joins : 
            1. left join 
            2. right join 
            3. inner join

# *Step - 13* : how to rename the columns

            - df.rename(mapper, axis, index, columns, inplace)

In [90]:
df

     Names  Age        City
0  Pratham   20    Bengluru
1    Kunal   30     Chennai
2    Rohit   40        Pune
3  Pratham   22  Chhindwara

In [91]:
map = {
    "Names" : "newNames"
}

df.rename(map)

     Names  Age        City
0  Pratham   20    Bengluru
1    Kunal   30     Chennai
2    Rohit   40        Pune
3  Pratham   22  Chhindwara

In [92]:
df.rename(map, axis=0)

     Names  Age        City
0  Pratham   20    Bengluru
1    Kunal   30     Chennai
2    Rohit   40        Pune
3  Pratham   22  Chhindwara

In [93]:
df.rename(map, axis= 1)

  newNames  Age        City
0  Pratham   20    Bengluru
1    Kunal   30     Chennai
2    Rohit   40        Pune
3  Pratham   22  Chhindwara

In [94]:
df.rename(index=map)

     Names  Age        City
0  Pratham   20    Bengluru
1    Kunal   30     Chennai
2    Rohit   40        Pune
3  Pratham   22  Chhindwara

In [95]:
df.rename(columns= map)

  newNames  Age        City
0  Pratham   20    Bengluru
1    Kunal   30     Chennai
2    Rohit   40        Pune
3  Pratham   22  Chhindwara

In [96]:
df.rename(map, axis=1, inplace=True)